Prehistoricman/TMS57070/Emulator/TMS57070_core.cpp
#include "TMS57070.h"
#include <cassert>

using namespace TMS57070;

//Decodes a load instruction and sets the ACC accordingly
//Returns pointer to the destination ACC
int24_t* Emulator::loadACC() {
	int32_t result;
	//Where is the data destination?
	int24_t* dst = &ACC1;
	if (opcode1_flag4) {
		dst = &ACC2;
	}
	//Where is the data source?
	uint8_t src_code = opcode1 & 3;
	switch (src_code) {
	case 0:
		result = DMEM[dmemAddressing()];
		break;
	case 1:
		result = CMEM[cmemAddressing()];
		break;
	case 2:
		if (opcode1_flag8) {
			result = ACC2.value;
		} else {
			result = ACC1.value;
		}
		break;
	case 3:
		if (opcode1_flag8) {
			result = MACC2_delayed2.getUpper().value;
		} else {
			result = MACC1_delayed2.getUpper().value;
		}
		break;
	default:
		result = 0;
		assert(false); //Should not happen
	}

	//Apply flags
	dst->value = processACCValue(result);

	return dst;
}

//Returns pointer to the destination ACC
int24_t* Emulator::arith(ArithOperation operation) {
	//Where is the data destination?
	int24_t* dst = &ACC1;
	if (opcode1_flag4) {
		dst = &ACC2;
	}
	//Where is the data source?
	uint8_t src_code = opcode1 & 3;
	int24_t lhs;
	int24_t rhs;
	if ((opcode1 == 0x3C) || (opcode1 == 0x3D) || (opcode1 == 0x3E)) {
		//These instructions use CMEM and DMEM always
		lhs.value = DMEM[dmemAddressing()];
		rhs.value = CMEM[cmemAddressing()];
	} else { //Normal ALU instructions
		switch (src_code) {
		case 0: //DMEM op ACCx
			lhs.value = DMEM[dmemAddressing()];
			if (opcode1_flag8) {
				rhs.value = ACC2.value;
			} else {
				rhs.value = ACC1.value;
			}
			break;
		case 1: //DMEM op MACCx
			lhs.value = DMEM[dmemAddressing()];
			if (opcode1_flag8) {
				rhs.value = MACC2.getUpper().value;
			} else {
				rhs.value = MACC1.getUpper().value;
			}
			break;
		case 2: //CMEM op ACCx
			lhs.value = CMEM[cmemAddressing()];
			if (opcode1_flag8) {
				rhs.value = ACC2.value;
			} else {
				rhs.value = ACC1.value;
			}
			break;
		case 3: //CMEM op MACCx
			lhs.value = CMEM[cmemAddressing()];
			if (opcode1_flag8) {
				rhs.value = MACC2.getUpper().value;
			} else {
				rhs.value = MACC1.getUpper().value;
			}
			break;
		default:
			assert(false); //Should not happen
			lhs.value = 0;
			rhs.value = 0;
		}
	}

	int32_t result;
	switch (operation) {
	case ArithOperation::Add:
		result = lhs.value + rhs.value;
		break;
	case ArithOperation::Sub:
		result = lhs.value - rhs.value;
		break;
	case ArithOperation::And:
		result = lhs.value & rhs.value;
		break;
	case ArithOperation::Or:
		result = lhs.value | rhs.value;
		break;
	case ArithOperation::Xor:
		result = lhs.value ^ rhs.value;
		break;
	case ArithOperation::Cmp:
		//Quit early to avoid writing to ACC
		result = lhs.value - rhs.value;
		if ((result < INT24_MIN) || (result > INT24_MAX)) {
			CR1.AOV = 1;
		}
		if (result == 0) {
			CR1.ACCZ = 1;
		} else if (result < 0) {
			CR1.ACCN = 1;
		}
		return nullptr; //This value doesn't get saved to ACC
		break;
	default:
		assert(false);
	}

	//Set flags
	result = processACCValue(result);

	dst->value = result;
	return dst;
}

//Takes in a new ACC value as a result of a calculation and:
//applies saturation logic, truncates, and sets overflow flag
//returns the correct value to load
int32_t Emulator::processACCValue(int32_t acc) {
	if (CR1.AOVM) { //saturation logic on
		if (acc < INT24_MIN) {
			//Saturate at minimum
			tms_printf("processACCValue: saturating value %d (%X) at -ve\n", acc, acc);
			acc = INT24_MIN;
			CR1.AOV = 1;
		} else if (acc > INT24_MAX) {
			tms_printf("processACCValue: saturating value %d (%X) at +ve\n", acc, acc);
			acc = INT24_MAX;
			CR1.AOV = 1;
		}
	} else { //saturation logic off
		//nothing to do?
		//TODO: can acc overflow with sat. logic off?
		if ((acc < INT24_MIN) || (acc > INT24_MAX)) {
			CR1.AOV = 1;
		}
	}
	
	int24_t acc_i24{acc}; //Value is truncated here. Sign is re-calculated, not preserved

	CR1.ACCZ = acc_i24.value == 0;
	CR1.ACCN = acc_i24.value < 0;

	return acc_i24.value;
}

void Emulator::exec1st() {
	switch (opcode1) {
	case 0x00: //NOP
		break;

	case 0x4: //Load accumulator unsigned
	case 0x5:
	case 0x6:
	case 0x7:
	{
		int24_t* dst = loadACC();
		if (dst->value < 0) { //TODO: test this
			dst->value = ~dst->value + 1;
		}

		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

	case 0x8: //Load accumulator complemented
	case 0x9:
	case 0xA:
	case 0xB:
	{
		int24_t* dst = loadACC();
		dst->value = ~dst->value + 1; //TODO: saturation logic

		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

	case 0x10: //Load accumulator
	case 0x11:
	case 0x12:
	case 0x13:
	{
		int24_t* dst = loadACC();

		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

	case 0x14: //Increment and load accumulator
	case 0x15:
	case 0x16:
	case 0x17:
	{
		int24_t* dst = loadACC();
		dst->value++;
		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

	case 0x18: //Decrement and load accumulator
	case 0x19:
	case 0x1A:
	case 0x1B:
	{
		int24_t* dst = loadACC();
		dst->value--;
		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

	case 0x1C:
	{ //SHACC shift accumulator
		int24_t* dst = &ACC1;
		if (opcode1_flag4) {
			dst = &ACC2;
		}
		int32_t value = dst->value;
		if (opcode1_flag8) {
			//shift left
			value = value << 1;
		} else {
			//Shift right
			value = value >> 1;
		}
		value = processACCValue(value);
		dst->value = value;
	} break;

	case 0x1D: //ZACC Zero accumulator (and something else)
		if (opcode1_flag8) {
			//assert(false); //idk
		} else {
			//ZACC zero accumulator
			int24_t* dst = &ACC1;
			if (opcode1_flag4) {
				dst = &ACC2;
			}
			dst->value = 0;
		}
		break;

	case 0x20: //Add accumulator
	case 0x21:
	case 0x22:
	case 0x23:
	{
		int24_t* dst = arith(ArithOperation::Add);
		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

	case 0x24: //Sub accumulator
	case 0x25:
	case 0x26:
	case 0x27:
	{
		int24_t* dst = arith(ArithOperation::Sub);
		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

