Prehistoricman/TMS57070/Emulator/TMS57070_core.cpp
	case 0x28: //AND accumulator
	case 0x29:
	case 0x2A:
	case 0x2B:
	{
		int24_t* dst = arith(ArithOperation::And);
		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

	case 0x2C: //OR accumulator
	case 0x2D:
	case 0x2E:
	case 0x2F:
	{
		int24_t* dst = arith(ArithOperation::Or);
		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

	case 0x30: //XOR accumulator
	case 0x31:
	case 0x32:
	case 0x33:
	{
		int24_t* dst = arith(ArithOperation::Xor);
		tms_printf("Set ACC%d to %X\n", opcode1_flag4 + 1, dst->value);
	} break;

	case 0x34: //CMP compare
	case 0x35:
	case 0x36:
	case 0x37:
	{
		int24_t* dst = arith(ArithOperation::Cmp);
	} break;

	case 0x3C: //ADD CMEM + DMEM
		if (opcode1_flag8) {
			arith(ArithOperation::Sub);
		} else {
			arith(ArithOperation::Add);
		}
		break;
	case 0x3D: //AND bitwise CMEM AND DMEM
		if (opcode1_flag8) {
			arith(ArithOperation::Or);
		} else {
			arith(ArithOperation::And);
		}
		break;

	case 0x39:
		//TODO
		break;

	case 0x40: //Multiply CMEM by ACCx
	case 0x41: //ACC2
	case 0x44: //Unsigned CMEM
	case 0x45: //ACC2
	case 0x48: //Unsigned ACC
	case 0x49: //ACC2
	case 0x4C: //Unsigned both
	case 0x4D: //ACC2
	{
		MAC* MACx = &MACC1;
		if (opcode1_flag4) MACx = &MACC2;

		bool negate = opcode1_flag8;

		int24_t* ACCx = &ACC1;
		if ((opcode1 & 1) == 1) ACCx = &ACC2;

		int24_t cmem_word{ (int32_t)CMEM[cmemAddressing()] };

		MACSigns signs;
		switch (opcode1) {
		case 0x40: case 0x41: signs = MACSigns::SS; break;
		case 0x44: case 0x45: signs = MACSigns::US; break;
		case 0x48: case 0x49: signs = MACSigns::SU; break;
		case 0x4C: case 0x4D: signs = MACSigns::UU; break;
		}

		MACx->multiply(cmem_word, *ACCx, signs, negate);
	} break;

	case 0x42: //Multiply CMEM by DMEM
	case 0x46: //unsigned CMEM
	case 0x4A: //unsigned DMEM
	case 0x4E: //unsigned both
	{
		MAC* MACx = &MACC1;
		if (opcode1_flag4) MACx = &MACC2;

		bool negate = opcode1_flag8;
		
		int24_t cmem_word{ (int32_t)CMEM[cmemAddressing()] };
		int24_t dmem_word{ (int32_t)DMEM[dmemAddressing()] };

		MACSigns signs;
		switch (opcode1) {
		case 0x42: signs = MACSigns::SS; break;
		case 0x46: signs = MACSigns::US; break;
		case 0x4A: signs = MACSigns::SU; break;
		case 0x4E: signs = MACSigns::UU; break;
		}

		MACx->multiply(cmem_word, dmem_word, signs, negate);
	} break;

	case 0x50: //MAC CMEM by ACCx
	case 0x51: //ACC2
	case 0x52: //MAC DMEM by ACCx
	case 0x53:
	{
		MAC* MACx = &MACC1;
		if (opcode1_flag4) MACx = &MACC2;

		bool negate = opcode1_flag8;

		int24_t* ACCx = &ACC1;
		if ((opcode1 & 1) == 1) ACCx = &ACC2;

		int24_t word{};
		if (opcode1 <= 0x51) {
			word.value = CMEM[cmemAddressing()];
		} else {
			word.value = DMEM[dmemAddressing()];
		}
		MACx->mac(*ACCx, word, MACSigns::SS, negate);
	} break;

	case 0x60: //Multiply CMEM by ACC (and accumulate shifted MAC)
	case 0x61: //ACC2
	case 0x62: //Multiply DMEM by ACC
	case 0x63: //ACC2
	{
		MAC* MACx = &MACC1;
		if (opcode1_flag4) MACx = &MACC2;

		bool negate = opcode1_flag8;

		int24_t* ACCx = &ACC1;
		if ((opcode1 & 1) == 1) ACCx = &ACC2;

		int24_t word{};
		if (opcode1 <= 0x61) {
			word.value = CMEM[cmemAddressing()];
		} else {
			word.value = DMEM[dmemAddressing()];
		}

		//Shift MAC right by 24
		MACx->shift(-24);

		MACx->mac(*ACCx, word, MACSigns::SS, negate);
	} break;

	case 0x6C: //MAC CMEM by DMEM
	case 0x6D: //unsigned CMEM
	case 0x6E: //unsigned DMEM
	case 0x6F: //unsigned both
	{
		MAC* MACx = &MACC1;
		if (opcode1_flag4) MACx = &MACC2;

		bool negate = opcode1_flag8;
		
		int24_t cmem_word{ (int32_t)CMEM[cmemAddressing()] };
		int24_t dmem_word{ (int32_t)DMEM[dmemAddressing()] };

		MACSigns signs;
		switch (opcode1) {
		case 0x6C: signs = MACSigns::SS; break;
		case 0x6D: signs = MACSigns::US; break;
		case 0x6E: signs = MACSigns::SU; break;
		case 0x6F: signs = MACSigns::UU; break;
		}

		MACx->mac(cmem_word, dmem_word, signs, negate);
	} break;

	case 0x70: //Multiply CMEM with DMEM (and accumulate with shifted MAC)
	case 0x71: //Unsigned DMEM
	{
		MAC* MACx = &MACC1;
		if (opcode1_flag4) MACx = &MACC2;

		bool negate = opcode1_flag8;

		int24_t cmem_word{ (int32_t)CMEM[cmemAddressing()] };
		int24_t dmem_word{ (int32_t)DMEM[dmemAddressing()] };

		MACSigns signs = MACSigns::SS;
		if (opcode1 == 0x71) {
			signs = MACSigns::US;
		}

		//Shift MAC right by 24
		MACx->shift(-24);

		MACx->mac(cmem_word, dmem_word, signs, negate);
	} break;

	case 0x72: //SHMAC shift MACC
	{
		MAC* MACx = &MACC1;
		if (opcode1_flag4) MACx = &MACC2;

		if (opcode1_flag8) { //Left shift
			MACx->shift(1);
		} else { //Right shift
			MACx->shift(-1);
		}
	} break;

	case 0x73: //Zero MACC (and something else)
		if (opcode1_flag8) {
			//assert(false); //idk
		} else {
			//Zero MACC
			MAC* MACx = &MACC1;
			if (opcode1_flag4) MACx = &MACC2;

			MACx->set(0);
		}
		break;

	case 0x78:
	case 0x79: //Load MAC high and clear
		if (opcode1_flag4) {
			MACC2.setLower(0);
		} else {
			MACC1.setLower(0);
		}
		//Let this fall through to set MAC high
	case 0x7A:
	case 0x7B: //Load MAC high
	case 0x7C:
	case 0x7D: //Load MAC low
	{
		int24_t load_word;
		if ((opcode1 & 0x1) == 0) { //Instructions 78, 7A, 7C: DMEM and ACC1
			if (opcode1_flag8) {
				load_word.value = ACC1.value;
			} else {
				load_word.value = (int32_t)DMEM[dmemAddressing()];
			}
		} else { //Instructions 79, 7B, 7D: CMEM and ACC2
			if (opcode1_flag8) {
				load_word.value = ACC2.value;
			} else {
				load_word.value = (int32_t)CMEM[cmemAddressing()];
			}
		}
		if (opcode1 < 0x7C) { //load MAC high
			if (opcode1_flag4) {
				MACC2.setUpper(load_word.value);
			} else {
				MACC1.setUpper(load_word.value);
			}
		} else { //load MAC low
			if (opcode1_flag4) {
				MACC2.setLower(load_word.value);
			} else {
				MACC1.setLower(load_word.value);
			}
		}
	} break;

	case 0xC1: //Load register with immediate
		switch ((insn >> 16) & 0xFF) {
		case 0x00:
			DA.one.value = insn;
			break;
		case 0x08:
			DA.two.value = insn;
			break;
		case 0x10:
			DIR.one.value = insn;
			break;
		case 0x18:
			DIR.two.value = insn;
			break;
		case 0x20:
			CA.one.value = insn;
			break;
		case 0x28:
			CA.two.value = insn;
			break;
		case 0x30:
			CIR.one.value = insn;
			break;
		case 0x38:
			CIR.two.value = insn;
			break;
		case 0x40: //LIRAE
			if (!CR1.ACCN) {
				CA.one.value = insn;
			}
			break;
		case 0x48: //LIRAE
			if (!CR1.ACCN) {
				CA.two.value = insn;
			}
			break;
		default:
			assert(false); //unknown
		}
		break;

	case 0xC2: //Load DA imm
		DA.one.value = (insn & 0xFFF);
		DA.two.value = ((insn >> 12) & 0xFFF);
		break;
	case 0xC3: //Load DIR imm
		DIR.one.value = (insn & 0xFFF);
		DIR.two.value = ((insn >> 12) & 0xFFF);
		break;
	case 0xC4: //Load CA imm
		CA.one.value = (insn & 0xFFF);
		CA.two.value = ((insn >> 12) & 0xFFF);
		break;
	case 0xC5: //Load CIR imm
		CIR.one.value = (insn & 0xFFF);
		CIR.two.value = ((insn >> 12) & 0xFFF);
		break;

	case 0xC7: //Set DMEM circular registers
		DOFF.value = insn;
		DCIRC.value = insn >> 12;
		break;
	case 0xC8: //Set CMEM circular registers
		COFF.value = insn;
		CCIRC.value = insn >> 12;
		break;

