Prehistoricman/TMS57070/Emulator/TMS57070_core.cpp
	case 0xCA: //Load ACC1 imm
		ACC1.value = insn;
		processACCValue(ACC1.value); //Set flags
		break;
	case 0xCB: //Load ACC2 imm
		ACC2.value = insn;
		processACCValue(ACC2.value); //Set flags
		break;
	case 0xCC: //Load CR0 imm
		CR0.value = insn;
		break;
	case 0xCD: //Load CR1 imm
		CR1.value = insn;
		break;
	case 0xCE: //Load CR2 imm
	{
		//Handle flag behaviour
		cr2_t temp;
		temp.value = insn;
		uint8_t flagsToClear = temp.bytes[0] & CR2.bytes[0]; //Only clear flags that are common to both the input value and current value
		temp.bytes[0] = CR2.bytes[0] ^ flagsToClear; //Erase common bits
		CR2.value = temp.value;
	} break;
	case 0xCF: //Load CR3 imm
		CR3.value = insn;
		break;

	case 0xE0: //RPTK repeat next instruction
		RPTC = insn >> 16;
		rep_start_PC.value = PC.value;
		rep_end_PC.value = PC.value;
		break;
	case 0xE4: //RTPB repeat block
		RPTC = insn >> 16;
		rep_start_PC.value = PC.value;
		rep_end_PC.value = insn;
		if (rep_end_PC.value == PC.value) {
			RPTC = 0; //RPTB cannot do a single-instruction loop
		}
		break;

	case 0xEC: //RET
		assert(SP != 0); //Stack underflow!
		SP--;
		PC.value = stack[SP].value;
		break;
	case 0xEE: //RETI
		assert(SP != 0); //Stack underflow!
		SP--;
		PC.value = stack[SP].value;
		CR2.FREE = 1;
		RPTC = 0;
		break;

	case 0xF0: //Jmp
	case 0xF1: //Conditional jumps
	case 0xF2:
	case 0xF3:
	case 0xF4:
	case 0xF5:
	case 0xF6:
	case 0xF7:
	case 0xF8: //Call
	case 0xF9: //Conditional call
	case 0xFA:
	case 0xFB:
	case 0xFC:
	case 0xFD:
	case 0xFE:
	case 0xFF:
		execJmp();
		break;

	default:
		tms_printf("Unhandled 1st instruction: %08X\n", insn);
		break;
	}
}

void Emulator::exec2nd() {
	switch (opcode2) {
	case 0x00: //NOP
		break;

	case 0x01: //Save ACCx to MEM
		if (opcode2_flag4) {
			//ACC2
			if (opcode2_flag8) {
				CMEM[cmemAddressing()] = ACC2.value;
			} else {
				DMEM[dmemAddressing()] = ACC2.value;
			}
		} else {
			//ACC1
			if (opcode2_flag8) {
				CMEM[cmemAddressing()] = ACC1.value;
			} else {
				DMEM[dmemAddressing()] = ACC1.value;
			}
		}
		break;
	case 0x02: //Save MACC high to MEM
		if (opcode2_flag4) {
			//MACC2
			if (opcode2_flag8) {
				CMEM[cmemAddressing()] = MACC2_delayed2.getUpper().value;
			} else {
				DMEM[dmemAddressing()] = MACC2_delayed2.getUpper().value;
			}
		} else {
			//MACC1
			if (opcode2_flag8) {
				CMEM[cmemAddressing()] = MACC1_delayed2.getUpper().value;
			} else {
				DMEM[dmemAddressing()] = MACC1_delayed2.getUpper().value;
			}
		}
		break;
	case 0x03: //Save MACC low to MEM
		if (opcode2_flag4) {
			//MACC2
			if (opcode2_flag8) {
				CMEM[cmemAddressing()] = MACC2_delayed2.getLower().value;
			} else {
				DMEM[dmemAddressing()] = MACC2_delayed2.getLower().value;
			}
		} else {
			//MACC1
			if (opcode2_flag8) {
				CMEM[cmemAddressing()] = MACC1_delayed2.getLower().value;
			} else {
				DMEM[dmemAddressing()] = MACC1_delayed2.getLower().value;
			}
		}
		break;

	case 0x06: //Load dual from CMEM
	{
		//Load: (arg = 0-3) DA, DIR, CA, DIR
		uint32_t value = CMEM[cmemAddressing()];
		switch (opcode2_args) {
		case 0: //Load DA
			DA.one.value = (value & 0xFFF);
			DA.two.value = ((value >> 12) & 0xFFF);
			break;
		case 1: //Load DIR
			DIR.one.value = (value & 0xFFF);
			DIR.two.value = ((value >> 12) & 0xFFF);
			break;
		case 2: //Load CA
			CA.one.value = (value & 0xFFF);
			CA.two.value = ((value >> 12) & 0xFFF);
			break;
		case 3: //Load CIR
			CIR.one.value = (value & 0xFFF);
			CIR.two.value = ((value >> 12) & 0xFFF);
			break;
		}
	} break;
	case 0x08: //Dereference CMEM ptr to DMEM addressing register
		if (opcode2_flag4) { //If 4 set, store in incrementing register
			if (opcode2_flag8) {
				DIR.two.value = CMEM[cmemAddressing()];
			} else {
				DIR.one.value = CMEM[cmemAddressing()];
			}
		} else {
			if (opcode2_flag8) {
				DA.two.value = CMEM[cmemAddressing()];
			} else {
				DA.one.value = CMEM[cmemAddressing()];
			}
		}
		break;
	case 0x09: //Dereference CMEM ptr to CMEM addressing register //FIXME: combine with 0x08?
		if (opcode2_flag4) { //If 4 set, store in incrementing register
			if (opcode2_flag8) {
				CIR.two.value = CMEM[cmemAddressing()];
			} else {
				CIR.one.value = CMEM[cmemAddressing()];
			}
		} else {
			if (opcode2_flag8) {
				CA.two.value = CMEM[cmemAddressing()];
			} else {
				CA.one.value = CMEM[cmemAddressing()];
			}
		}
		break;

	case 0x0C: //Audio input
	case 0x0D:
		if (opcode2_flag8) { //right channel
			if (opcode2 == 0x0C) {
				DMEM[dmemAddressing()] = AR1R.value;
			} else {
				DMEM[dmemAddressing()] = AR2R.value;
			}
		} else { //left channel
			if (opcode2 == 0x0C) {
				DMEM[dmemAddressing()] = AR1L.value;
			} else {
				DMEM[dmemAddressing()] = AR2L.value;
			}
		}

	case 0x18:
		if (opcode2_flag8) { //right channel
			if (opcode2_flag4) {
				AX1R.value = MACC2_delayed2.getUpper().value;
				sample_out_cb(Channel::out_1R, AX1R.value);
			} else {
				AX1R.value = MACC1_delayed2.getUpper().value;
				sample_out_cb(Channel::out_1R, AX1R.value);
			}
		} else { //left channel
			if (opcode2_flag4) {
				AX1L.value = MACC2_delayed2.getUpper().value;
				sample_out_cb(Channel::out_1L, AX1L.value);
			} else {
				AX1L.value = MACC1_delayed2.getUpper().value;
				sample_out_cb(Channel::out_1L, AX1L.value);
			}
		}
		break;
	case 0x19:
		if (opcode2_flag8) { //right channel
			if (opcode2_flag4) {
				AX2R.value = MACC2_delayed2.getUpper().value;
				sample_out_cb(Channel::out_2R, AX2R.value);
			} else {
				AX2R.value = MACC1_delayed2.getUpper().value;
				sample_out_cb(Channel::out_2R, AX2R.value);
			}
		} else { //left channel
			if (opcode2_flag4) {
				AX2L.value = MACC2_delayed2.getUpper().value;
				sample_out_cb(Channel::out_2L, AX2L.value);
			} else {
				AX2L.value = MACC1_delayed2.getUpper().value;
				sample_out_cb(Channel::out_2L, AX2L.value);
			}
		}
		break;
	case 0x1A:
		if (opcode2_flag8) { //right channel
			if (opcode2_flag4) {
				AX3R.value = MACC2_delayed2.getUpper().value;
				sample_out_cb(Channel::out_3R, AX3R.value);
			} else {
				AX3R.value = MACC1_delayed2.getUpper().value;
				sample_out_cb(Channel::out_3R, AX3R.value);
			}
		} else { //left channel
			if (opcode2_flag4) {
				AX3L.value = MACC2_delayed2.getUpper().value;
				sample_out_cb(Channel::out_3L, AX3L.value);
			} else {
				AX3L.value = MACC1_delayed2.getUpper().value;
				sample_out_cb(Channel::out_3L, AX3L.value);
			}
		}
		break;

