Prehistoricman/TMS57070/Emulator/TMS57070_core.cpp
	case 0x23:
		switch (opcode2_args) {
		case 0:
			CMEM[cmemAddressing()] = CR0.value;
			tms_printf("CR0 is %06X\n", CR0.value);
			break;
		case 1:
			CMEM[cmemAddressing()] = CR1.value;
			tms_printf("CR1 is %06X\n", CR1.value);
			break;
		case 2:
			CMEM[cmemAddressing()] = CR2.value;
			tms_printf("CR2 is %06X\n", CR2.value);
			break;
		case 3:
			CMEM[cmemAddressing()] = CR3.value;
			tms_printf("CR3 is %06X\n", CR3.value);
			break;
		}
		break;

	case 0x26: //Load HIR with a value from C/DMEM
		if (opcode2_flag8) {
			HIR.value = CMEM[cmemAddressing()];
		} else {
			HIR.value = DMEM[dmemAddressing()];
		}
		break;

	case 0x27: //Handle circular memory
		if (!CR1.LCMEM) {
			uint32_t insn_temp = insn;
			insn = 0x00002000 + CCIRC.value; //ugly hack
			uint32_t current_end = CMEM[cmemAddressing()];
			COFF.value--;
			insn = 0x00002000; //ugly hack
			CMEM[cmemAddressing()] = current_end; //Set new start to old end
		}
		if (!CR1.LDMEM) {
			uint32_t insn_temp = insn;
			insn = 0x00002000 + DCIRC.value; //ugly hack
			uint32_t current_end = DMEM[dmemAddressing()];
			DOFF.value--;
			insn = 0x00002000; //ugly hack
			DMEM[dmemAddressing()] = current_end; //Set new start to old end

			DA.two.value = 0;
		}
		break;

	case 0x29: //MAC shifter mode
	{
		CR1.MOSM = opcode2_args;
		int8_t output_shift = 0;
		switch (CR1.MOSM) {
		case 0: output_shift = 0; break;
		case 1: output_shift = 2; break;
		case 2: output_shift = 4; break;
		case 3: output_shift = -8; break;
		default: assert(false);
		}
		MACC1.output_shift = output_shift;
		MACC2.output_shift = output_shift;
		MACC1_delayed2.output_shift = output_shift;
		MACC2_delayed2.output_shift = output_shift;
		MACC1_delayed1.output_shift = output_shift;
		MACC2_delayed1.output_shift = output_shift;
	} break;

	case 0x2C:
		if (opcode2_flag8) {
			//unknown
		} else {
			CR2.FREE = opcode2_flag4;
		}
		break;
	case 0x2D:
		if (opcode2_flag8) {
			CR1.MOVM = opcode2_flag4;
		} else {
			CR1.AOVM = opcode2_flag4;
		}
		break;
	case 0x2E:
		if (opcode2_flag8) {
			CR1.LCMEM = opcode2_flag4;
		} else {
			CR1.LDMEM = opcode2_flag4;
		}
		break;

	default:
		tms_printf("Unhandled 2nd instruction: %08X\n", insn);
		break;
	}
}

//Returns CMEM address specified by the current instruction
uint32_t Emulator::cmemAddressing() {
	uint8_t mode = (insn >> 12) & 3;
	bool ca_switch;
	uint32_t addr = 0;

	switch (mode) {
	case 0:
		//bad
		break;
	case 1:
		//Indirect
		ca_switch = insn & 0x00000800;
		if (ca_switch) {
			addr = CA.two.value;
		} else {
			addr = CA.one.value;
		}
		break;
	case 2:
		//Direct
		addr = insn;
		break;
	case 3:
		//Indirect
		ca_switch = insn & 0x00000100;
		if (ca_switch) {
			addr = CA.two.value;
		} else {
			addr = CA.one.value;
		}
		break;
	default:
		assert(false); //Should not happen
	}

	if (!CR1.LCMEM) {
		addr += COFF.value;
	}
	
	if (CR1.EXT && CR1.EXTMEM) { //CMEM is 512 words
		return addr & 0x1FF;
	} else { //CMEM is 256 words
		return addr & 0xFF;
	}
}

//Returns DMEM address specified by the current instruction
uint32_t Emulator::dmemAddressing() {
	uint8_t mode = (insn >> 12) & 3;
	bool ca_switch;
	uint32_t addr = 0;

	switch (mode) {
	case 0:
		//bad
		break;
	case 1:
		//Direct
		addr = insn;
		break;
	case 2:
	case 3:
		//Indirect
		ca_switch = insn & 0x00000800;
		if (ca_switch) {
			addr = DA.two.value;
		} else {
			addr = DA.one.value;
		}
		break;
	default:
		assert(false); //Should not happen
	}

	if (!CR1.LDMEM) {
		addr += DOFF.value;
	}

	if (CR1.EXT && !CR1.EXTMEM) { //DMEM is 512 words
		return addr & 0x1FF;
	} else { //DMEM is 256 words
		return addr & 0xFF;
	}
}

//Handle any jmp/call instruction
void Emulator::execJmp() {
	//Get the two nibbles after the first one. A jump instruction may be 0xF1800045 - in this case we want '18'
	//Also AND with 7F to give jumps (0xF0 based) and calls (0xF8 based) the same conditions
	uint8_t args = (insn >> (4 + 16)) & 0x7F;

	bool is_call = opcode1 >= 0xF8;
	bool condition_pass = false;
	uint16_t target_address = insn;

	switch (args) {
	case 0x00: //Unconditional
		condition_pass = true;
		break;
	case 0x08: //Unconditional indirect
		condition_pass = true;
		target_address = ACC1.value;
		break;
	case 0x0C: //Unconditional indirect
		condition_pass = true;
		target_address = ACC2.value;
		break;
	case 0x10: //if zero
		condition_pass = CR1.ACCZ;
		break;
	case 0x18: //if not zero
		condition_pass = !CR1.ACCZ;
		break;
	case 0x20: //if greater than zero
		condition_pass = !(CR1.ACCZ || CR1.ACCN);
		break;
	case 0x28: //if less than zero
		condition_pass = CR1.ACCN;
		break;
	case 0x30: //if ACC overflow
		condition_pass = CR1.AOV;
		break;
	case 0x38: //if ??? - CR1 bit 1
		condition_pass = CR1.ACCsomething;
		break;
	case 0x40: //if ??? - CR1 bit 4
		condition_pass = CR1.MACOV2;
		break;
	case 0x48: //if MAC overflow - CR1 bit 5
		condition_pass = CR1.MACOV;
		break;
	case 0x50: //if ??? - CR1 bit 6
		condition_pass = CR1.MACOV4;
		break;
	case 0x58: //if BIO low TODO
		
		break;
	default:
		assert(false); //Unhandled jump type
	}
	if (condition_pass) {
		if (is_call) {
			assert(SP != 4); //Stack overflow!
			stack[SP].value = PC.value;
			SP++;
		}

		PC.value = target_address;

		if (is_call)
			tms_printf("Calling %03X\n", PC.value);
		else
			tms_printf("Jumping to %03X\n", PC.value);
	}
}

void Emulator::execPostIncrements() {
	const uint8_t addrMode = (insn >> 12) & 3;
	const uint8_t nibble2 = (insn >> 8) & 0xF; //Often referred to as 'i' in my notes
	const uint8_t nibble1 = (insn >> 4) & 0xF; //Often referred to as 'z' in my notes

	//DA control
	if (addrMode & 2) {
		uint12_t* DAx = &DA.one;
		if (nibble2 & 8) { //Use DA2
			DAx = &DA.two;
		}
		if (nibble2 & 4) {
			//Increment with incrementing register
			uint12_t* DIRx = &DIR.one;
			if (nibble2 & 2) {
				//Use other incrementing register
				DIRx = &DIR.two;
			}
			DAx->value += DIRx->value;
		} else {
			if (nibble2 & 2) {
				//Increment
				DAx->value++;
			}
		}
	}

	//CA control
	if (addrMode == 1) {
		uint12_t* CAx = &CA.one;
		if (nibble2 & 8) { //Use CA2
			CAx = &CA.two;
		}
		if (nibble2 & 4) {
			//Increment with incrementing register
			uint12_t* CIRx = &CIR.one;
			if (nibble2 & 2) {
				//Use other incrementing register
				CIRx = &CIR.two;
			}
			CAx->value += CIRx->value;
		} else {
			if (nibble2 & 2) {
				//Increment
				CAx->value++;
			}
		}
	} else if (addrMode == 3) {
		uint12_t* CAx = &CA.one;
		if (nibble2 & 1) { //Use CA2
			CAx = &CA.two;
		}
		if (nibble1 & 8) {
			//Increment with incrementing register
			uint12_t* CIRx = &CIR.one;
			if (nibble1 & 4) {
				//Use other incrementing register
				CIRx = &CIR.two;
			}
			CAx->value += CIRx->value;
		} else {
			if (nibble1 & 4) {
				//Increment
				CAx->value++;
			}
		}
	}

