Prehistoricman/TMS57070/Emulator/TMS57070_core.cpp
#if 0
	switch (addrMode) {
	case 0:

		break;
	case 1:
	{
		/*
		00001i00
		Set bit 3(8) of i for CA2 rather than CA1
		Set bit 2(4) of i to increment with incrementing register
		Set bit 1(2) of i for post-increment or to change incrementing register
		*/
		uint12_t* CAx = &CA.one;
		if (nibble2 & 8) { //Use CA2
			CAx = &CA.two;
		}
		if (nibble2 & 4) {
			//Increment with incrementing register
			uint12_t* CIRx = &CIR.one;
			if (nibble2 & 2) {
				//Use other incrementing register
				uint12_t* CIRx = &CIR.two;
			}
			CAx->value += CIRx->value;
		} else {
			if (nibble2 & 2) {
				//Increment
				CAx->value++;
			}
		}
	} break;
	case 2:
	{
		/*
		00002i00
		Set bit 3(8) of i for DA2 rather than DA1
		Set bit 2(4) of i to increment with incrementing register
		Set bit 1(2) of i for post-increment or to change incrementing register
		*/
		uint12_t* DAx = &DA.one;
		if (nibble2 & 8) { //Use DA2
			DAx = &DA.two;
		}
		if (nibble2 & 4) {
			//Increment with incrementing register
			uint12_t* CIRx = &DIR.one;
			if (nibble2 & 2) {
				//Use other incrementing register
				uint12_t* CIRx = &DIR.two;
			}
			DAx->value += CIRx->value;
		} else {
			if (nibble2 & 2) {
				//Increment
				DAx->value++;
			}
		}
	} break;
	case 3:
	{
		/*
		00003iz0
		Set bit 0(1) of i for CA2 rather than CA1
		Set bit 2(4) of z for post-increment or to change incrementing register
		Set bit 3(8) of z to increment with incrementing register
		DA control:
		Set bit 3(8) of i to switch from DA1 to DA2
		Set bit 2(4) of i to increment with incrementing register
		Set bit 1(2) of i to post-increment or to change incrementing register
		*/
		//DA control is the same as 2
		uint12_t* DAx = &DA.one;
		if (nibble2 & 8) { //Use DA2
			DAx = &DA.two;
		}
		if (nibble2 & 4) {
			//Increment with incrementing register
			uint12_t* CIRx = &DIR.one;
			if (nibble2 & 2) {
				//Use other incrementing register
				uint12_t* CIRx = &DIR.two;
			}
			DAx->value += CIRx->value;
		} else {
			if (nibble2 & 2) {
				//Increment
				DAx->value++;
			}
		}

		//CA control
		uint12_t* CAx = &CA.one;
		if (nibble1 & 1) { //Use CA2
			CAx = &CA.two;
		}
		if (nibble1 & 8) {
			//Increment with incrementing register
			uint12_t* CIRx = &CIR.one;
			if (nibble1 & 4) {
				//Use other incrementing register
				uint12_t* CIRx = &CIR.two;
			}
			CAx->value += CIRx->value;
		} else {
			if (nibble1 & 4) {
				//Increment
				CAx->value++;
			}
		}
	} break;
	}
#endif
}